---
kind: other
id: Properties.T:Autodesk.Revit.DB.UpdaterId
source: html/5a53d426-fd9f-4b90-bf98-accc9b22967d.htm
---
# UpdaterId Properties

Specifies whether the .NET object represents a valid Revit entity.